In [148]:
# Kishan Chand                                       Assignment                                               Feb24-23

# Q1. List any five functions of the pandas library with execution.

In [54]:
import pandas as pd

a={"Name":["aaa","bbb","ccc","ddd","eee"],"marks":[55,66,77,88,33],"sex":["M","F","M","F","M"]}
df =pd.DataFrame(a)
df

  Name  marks sex
0  aaa     55   M
1  bbb     66   F
2  ccc     77   M
3  ddd     88   F
4  eee     33   M

In [55]:
b=pd.DataFrame({"Grade":["E","D","C","B","F"],"Name":["aaa","bbb","ccc","ddd","eee"]})
b

  Grade Name
0     E  aaa
1     D  bbb
2     C  ccc
3     B  ddd
4     F  eee

In [6]:
df.head(3)

  Name  marks sex
0  aaa     55   M
1  bbb     66   F
2  ccc     77   M

In [10]:
import pandas as pd
grouped = df.groupby('sex').max()
print(grouped)

    Name  marks
sex
F    ddd     88
M    eee     77

In [15]:
import pandas as pd
merged = pd.merge(df, b, on='Name')
print(merged.head())

  Name  marks sex Grade
0  aaa     55   M     E
1  bbb     66   F     D
2  ccc     77   M     C
3  ddd     88   F     B
4  eee     33   M     F

In [17]:
import pandas as pd
counts = b['Grade'].value_counts()
print(counts)

E    1
D    1
C    1
B    1
F    1
Name: Grade, dtype: int64

In [19]:
df.isna().sum()

Name     0
marks    0
sex      0
dtype: int64

# Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [24]:
df1=pd.DataFrame({"A":[1,2,3,4,5],"B":[111,222,333,444,555],"C":[10,20,30,40,50]})



def reindex_fun(df1):
    # get the number of rows in the DataFrame
    n_rows = df1.shape[0]
    
    # create a new index that starts from 1 and increments by 2 for each row
    new_index = range(1, n_rows * 2 + 1, 2)
    
    # reindex the DataFrame with the new index
    df_reindexed = df.reindex(new_index)
    
    return df_reindexed


df1_fun =reindex_fun(df1)
df1_fun

     A    B
1  NaN  NaN
3  2.0  5.0
5  NaN  NaN
7  NaN  NaN
9  NaN  NaN

# Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console. 

# For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [62]:
df2=pd.DataFrame({"Values":[10,20,30,40,50]})

def rf(df2):
    # get the first three values in the 'Values' column
    s =df2['Values'].iloc[:3]
     # calculate the sum of the first three values
    sum_is=s.sum()
    print("Sum of first three Values are",sum_is)
    return sum_is

summation =rf(df2)
summation

Sum of first three Values are 60

60

# Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [23]:
import pandas as pd
a={'text':["Hello kishan how are you doing","I hope you are doing well","All the best","for your career","God please save me","Bless me"]}
dfr=pd.DataFrame(a)
dfr

                             text
0  Hello kishan how are you doing
1       I hope you are doing well
2                    All the best
3                 for your career
4              God please save me
5                        Bless me

In [26]:
dfr['char_count']=dfr['text'].apply(len)
#para['len_data'] =para['ABD'].apply(len)

In [58]:
dfr['email-ids']= ['kishan@gmail.com','chand@gmail.com','kc@gmail.com','TTKKCC@gmail.com','krish333@gmail.com','naik@gmai.com']
dfr['Values'] =[10,20,30,45,55,65]

In [59]:
dfr['word_count'] =dfr['text'].apply(lambda x:len(x.split()))

In [60]:
dfr

,text,word_count,char_count,email-ids,Username,Values
0,Hello kishan how are you doing,6,30,kishan@gmail.com,kishan,10
1,I hope you are doing well,6,25,chand@gmail.com,chand,20
2,All the best,3,12,kc@gmail.com,kc,30
3,for your career,3,15,TTKKCC@gmail.com,TTKKCC,45
4,God please save me,4,18,krish333@gmail.com,krish333,55
5,Bless me,2,8,naik@gmai.com,naik,65

# Q5. How are DataFrame.size() and DataFrame.shape() different?

In [40]:
dfr.size

18

In [39]:
dfr.shape

(6, 3)


As we can see in the above Example, DataFrame.size and DataFrame.shape are two different attributes that return different information about the DataFrame.


where,DataFrame.size returns the total number of elements in the DataFrame, which is equal to the number of rows multiplied by the number of columns.and DataFrame.shape returns a tuple that contains the number of rows and columns in the DataFrame.

# Q6. Which function of pandas do we use to read an excel file?

In [ ]:
pd.read_excel()

# Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

# The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [45]:
dfr

                             text  word_count  char_count           email-ids
0  Hello kishan how are you doing           6          30    kishan@gmail.com
1       I hope you are doing well           6          25     chand@gmail.com
2                    All the best           3          12        kc@gmail.com
3                 for your career           3          15    TTKKCC@gmail.com
4              God please save me           4          18  krish333@gmail.com
5                        Bless me           2           8       naik@gmai.com

In [53]:
dfr['Username'] =dfr['email-ids'].apply(lambda x:x.split('@')[0])

In [54]:
dfr

,text,word_count,char_count,email-ids,Username
0,Hello kishan how are you doing,6,30,kishan@gmail.com,kishan
1,I hope you are doing well,6,25,chand@gmail.com,chand
2,All the best,3,12,kc@gmail.com,kc
3,for your career,3,15,TTKKCC@gmail.com,TTKKCC
4,God please save me,4,18,krish333@gmail.com,krish333
5,Bless me,2,8,naik@gmai.com,naik

 Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

For example, 

if df contains the following values:

  A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [55]:
df8 =pd.DataFrame({"A":[3,8,6,2,9],"B":[5,2,9,3,1],"C":[1,7,4,5,2]})
df8

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [57]:
df8[(df8["A"]>5) & (df8["B"]<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

# Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [61]:
dfr

,text,word_count,char_count,email-ids,Username,Values
0,Hello kishan how are you doing,6,30,kishan@gmail.com,kishan,10
1,I hope you are doing well,6,25,chand@gmail.com,chand,20
2,All the best,3,12,kc@gmail.com,kc,30
3,for your career,3,15,TTKKCC@gmail.com,TTKKCC,45
4,God please save me,4,18,krish333@gmail.com,krish333,55
5,Bless me,2,8,naik@gmai.com,naik,65

In [82]:
def mct(Values):
    med= dfr['Values'].median()
    mea= dfr['Values'].mean()
    mod= dfr['Values'].mode()
    std= dfr['Values'].std()
    return med,mea,mod,std

mea,med,mod,std =mct(dfr['Values'])
print(f"mean of the values is{mea}")
print(f"median of the values is{med}")
print("mode of the values is\n{}".format(mod))
print("standard deviation of the values is {}".format(std))

mean of the values is37.5
median of the values is37.5
mode of the values is
0    10
1    20
2    30
3    45
4    55
5    65
Name: Values, dtype: int64
standard deviation of the values is 21.15419580130618

# Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [103]:
DF =pd.DataFrame({"Sales":[100,200,325,460,580,610,777,822,900],"Date":['2023-04-28','2023-04-29','2023-04-30','2023-04-31','2023-05-02','2023-05-03','2023-05-04','2023-05-05','2023-05-06']})

In [104]:
DF

   Sales        Date
0    100  2023-04-28
1    200  2023-04-29
2    325  2023-04-30
3    460  2023-04-31
4    580  2023-05-02
5    610  2023-05-03
6    777  2023-05-04
7    822  2023-05-05
8    900  2023-05-06

In [106]:

def calculate_moving_average(DF,col_name,window_size):
    DF["Sales moving average"] =DF['Sales'].rolling(window_size).mean()
    return DF
    
    
    
DF =calculate_moving_average(DF,"Sales",7)
DF

   Sales        Date  Sales moving average
0    100  2023-04-28                   NaN
1    200  2023-04-29                   NaN
2    325  2023-04-30                   NaN
3    460  2023-04-31                   NaN
4    580  2023-05-02                   NaN
5    610  2023-05-03                   NaN
6    777  2023-05-04            436.000000
7    822  2023-05-05            539.142857
8    900  2023-05-06            639.142857

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [125]:
date =pd.date_range(start='2023-01-01',end='2023-01-05')

df11 =pd.DataFrame({"Date":date})
                
def add_weekday_column(df11):
     
    df11['day'] =df11['Date'].dt.day
    
    df11['month'] =df11['Date'].dt.month
    # create new column 'Weekday' with weekday name
    df11['Weekday'] = df11['Date'].dt.day_name()
    
    return df11
new_df = add_weekday_column(df11)
print(new_df)

        Date  day  month    Weekday
0 2023-01-01    1      1     Sunday
1 2023-01-02    2      1     Monday
2 2023-01-03    3      1    Tuesday
3 2023-01-04    4      1  Wednesday
4 2023-01-05    5      1   Thursday

# Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [126]:
date12 =pd.date_range(start="2023-01-01",end="2023-03-01")
date12

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10', '2023-01-11', '2023-01-12',
               '2023-01-13', '2023-01-14', '2023-01-15', '2023-01-16',
               '2023-01-17', '2023-01-18', '2023-01-19', '2023-01-20',
               '2023-01-21', '2023-01-22', '2023-01-23', '2023-01-24',
               '2023-01-25', '2023-01-26', '2023-01-27', '2023-01-28',
               '2023-01-29', '2023-01-30', '2023-01-31', '2023-02-01',
               '2023-02-02', '2023-02-03', '2023-02-04', '2023-02-05',
               '2023-02-06', '2023-02-07', '2023-02-08', '2023-02-09',
               '2023-02-10', '2023-02-11', '2023-02-12', '2023-02-13',
               '2023-02-14', '2023-02-15', '2023-02-16', '2023-02-17',
               '2023-02-18', '2023-02-19', '2023-02-20', '2023-02-21',
               '2023-02-22', '2023-02-23', '2023-02-24', '2023-02-25',
               '2023-02-26', '2023-02-27', '2023-02-28', '2023-03-01'],
              dtype='datetime64[ns]', freq='D')

In [147]:
df12 =pd.DataFrame({"Date":date12})


def specified_range(df12):
    df12['datetime_format']=pd.to_datetime(df12['Date'])
    df_req =(df12['datetime_format']>='2023-01-01') & (df12['datetime_format']<='2023-01-31')
    df1 =df12.loc[df_req]
    return df1
w =specified_range(df12)
w

         Date datetime_format
0  2023-01-01      2023-01-01
1  2023-01-02      2023-01-02
2  2023-01-03      2023-01-03
3  2023-01-04      2023-01-04
4  2023-01-05      2023-01-05
5  2023-01-06      2023-01-06
6  2023-01-07      2023-01-07
7  2023-01-08      2023-01-08
8  2023-01-09      2023-01-09
9  2023-01-10      2023-01-10
10 2023-01-11      2023-01-11
11 2023-01-12      2023-01-12
12 2023-01-13      2023-01-13
13 2023-01-14      2023-01-14
14 2023-01-15      2023-01-15
15 2023-01-16      2023-01-16
16 2023-01-17      2023-01-17
17 2023-01-18      2023-01-18
18 2023-01-19      2023-01-19
19 2023-01-20      2023-01-20
20 2023-01-21      2023-01-21
21 2023-01-22      2023-01-22
22 2023-01-23      2023-01-23
23 2023-01-24      2023-01-24
24 2023-01-25      2023-01-25
25 2023-01-26      2023-01-26
26 2023-01-27      2023-01-27
27 2023-01-28      2023-01-28
28 2023-01-29      2023-01-29
29 2023-01-30      2023-01-30
30 2023-01-31      2023-01-31


# Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

As Pandas is dependent on the NumPy library, we need to import this dependency,which is numpy.